meshtastic/firmware/src/platform/nrf54l15/NRF54L15Bluetooth.cpp
  public:
    BluetoothPhoneAPI() { api_type = TYPE_BLE; }
};

static BluetoothPhoneAPI *phoneAPI = nullptr;

// ── CCC change callbacks
// ──────────────────────────────────────────────────────

static void fromnum_ccc_changed(const struct bt_gatt_attr *attr, uint16_t value)
{
    fromnum_ccc_val = value;
    LOG_INFO("BLE fromNum CCC: %u", value);
}

static void logradio_ccc_changed(const struct bt_gatt_attr *attr, uint16_t value)
{
    logradio_ccc_val = value;
    LOG_INFO("BLE logRadio CCC: %u", value);
}

// ── GATT attribute callbacks
// ──────────────────────────────────────────────────

static ssize_t read_fromnum(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset)
{
    LOG_INFO("GATT read_fromnum: fromNum=%u offset=%u", fromNumValue, offset);
    return bt_gatt_attr_read(conn, attr, buf, len, offset, &fromNumValue, sizeof(fromNumValue));
}

static ssize_t read_fromradio(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset)
{
    if (offset == 0) {
        // First chunk: pull the next packet from the queue.
        // Subsequent chunks (offset > 0) are ATT_READ_BLOB continuations of the
        // same value and must reuse fromRadioBytes untouched.
        fromRadioLen = phoneAPI ? phoneAPI->getFromRadio(fromRadioBytes) : 0;
        LOG_DEBUG("GATT read_fromradio len=%u", (unsigned)fromRadioLen);
    }
    last_att_time_ms = k_uptime_get_32();
    return bt_gatt_attr_read(conn, attr, buf, len, offset, fromRadioBytes, fromRadioLen);
}

static ssize_t read_logradio(struct bt_conn *conn, const struct bt_gatt_attr *attr, void *buf, uint16_t len, uint16_t offset)
{
    // logRadio is write-only from the device side (notify/indicate).
    // Return an empty read so GATT discovery doesn't fail with NOT_PERMITTED.
    return bt_gatt_attr_read(conn, attr, buf, len, offset, NULL, 0);
}

static ssize_t write_toradio(struct bt_conn *conn, const struct bt_gatt_attr *attr, const void *buf, uint16_t len,
                             uint16_t offset, uint8_t flags)
{
    // Writes >MTU-3 arrive here with offset=0 and
    // flags=BT_GATT_WRITE_FLAG_EXECUTE after Zephyr reassembles the ATT Prepare
    // Write fragments (CONFIG_BT_ATT_PREPARE_COUNT>0).  Single writes arrive with
    // flags=0.
    LOG_DEBUG("GATT write_toradio len=%u flags=0x%x", len, flags);
    if (offset != 0) {
        return BT_GATT_ERR(BT_ATT_ERR_INVALID_OFFSET);
    }
    // Reject any write that won't fit in the dedup buffer (lastToRadio) or the
    // pending handoff buffer (pendingToRadioBuf), both sized
    // MAX_TO_FROM_RADIO_SIZE. Returning success while silently dropping a
    // payload would let the phone believe a config write was applied.
    if (len > sizeof(toRadioBytes) || len > MAX_TO_FROM_RADIO_SIZE) {
        return BT_GATT_ERR(BT_ATT_ERR_INVALID_ATTRIBUTE_LEN);
    }

    // Deduplicate - drop packet if identical to the last one we processed
    if (memcmp(lastToRadio, buf, len) != 0) {
        memcpy(lastToRadio, buf, len);
        if (len < MAX_TO_FROM_RADIO_SIZE) {
            memset(lastToRadio + len, 0, MAX_TO_FROM_RADIO_SIZE - len);
        }
        // Defer handleToRadio() to BleDeferredThread (24 KB stack).
        // Running it here on bt_workq (6 KB) overflows during handleStartConfig.
        // Always overwrite pending - we already dedup'd above via lastToRadio,
        // so any new write here is genuinely new data that must be delivered.
        k_mutex_lock(&pendingToRadioMutex, K_FOREVER);
        memcpy(pendingToRadioBuf, buf, len);
        pendingToRadioLen = len;
        pendingToRadio = true;
        k_mutex_unlock(&pendingToRadioMutex);
    }
    last_att_time_ms = k_uptime_get_32();
    return (ssize_t)len;
}

// ── GATT service definition (static, linked at compile time)
// ──────────────────
//
// Attribute indices (0-based):
//   [0]  Primary Service declaration
//   [1]  fromNum characteristic declaration
//   [2]  fromNum value            ← notify target (FROMNUM_ATTR_IDX)
//   [3]  fromNum CCC descriptor
//   [4]  fromRadio characteristic declaration
//   [5]  fromRadio value
//   [6]  toRadio characteristic declaration
//   [7]  toRadio value
//   [8]  logRadio characteristic declaration
//   [9]  logRadio value           ← notify target (LOGRADIO_ATTR_IDX)
//   [10] logRadio CCC descriptor

// All user characteristics require authenticated encryption (MITM passkey)
// before the client can read/write. This mirrors the nrf52
// SECMODE_ENC_WITH_MITM service permission. The stack returns "Insufficient
// Authentication" on the first access attempt, prompting the client to pair
// with the configured PIN.
#define MESH_PERM_READ (BT_GATT_PERM_READ | BT_GATT_PERM_READ_AUTHEN)
#define MESH_PERM_WRITE (BT_GATT_PERM_WRITE | BT_GATT_PERM_WRITE_AUTHEN)

BT_GATT_SERVICE_DEFINE(mesh_svc, BT_GATT_PRIMARY_SERVICE(&mesh_svc_uuid.uuid),

                       // fromNum: READ | NOTIFY - packet-counter triggers phone to read fromRadio
                       BT_GATT_CHARACTERISTIC(&fromnum_uuid.uuid, BT_GATT_CHRC_READ | BT_GATT_CHRC_NOTIFY, MESH_PERM_READ,
                                              read_fromnum, NULL, &fromNumValue),
                       BT_GATT_CCC(fromnum_ccc_changed, MESH_PERM_READ | MESH_PERM_WRITE),

                       // fromRadio: READ - phone polls this after receiving a fromNum notification
                       BT_GATT_CHARACTERISTIC(&fromradio_uuid.uuid, BT_GATT_CHRC_READ, MESH_PERM_READ, read_fromradio, NULL,
                                              NULL),

                       // toRadio: WRITE - phone sends protobuf packets to the device
                       BT_GATT_CHARACTERISTIC(&toradio_uuid.uuid, BT_GATT_CHRC_WRITE, MESH_PERM_WRITE, NULL, write_toradio, NULL),

                       // logRadio: READ | NOTIFY | INDICATE - log stream to phone when connected
                       BT_GATT_CHARACTERISTIC(&logradio_uuid.uuid,
                                              BT_GATT_CHRC_READ | BT_GATT_CHRC_NOTIFY | BT_GATT_CHRC_INDICATE, MESH_PERM_READ,
                                              read_logradio, NULL, NULL),
                       BT_GATT_CCC(logradio_ccc_changed, MESH_PERM_READ | MESH_PERM_WRITE), );

// ── Advertising
// ───────────────────────────────────────────────────────────────
//
// Use legacy advertising (bt_le_adv_start / HCI 0x2006 path).
//
// History: we previously used bt_le_ext_adv_create (true extended advertising)
// because bt_le_adv_start() with CONFIG_BT_EXT_ADV=y was translated internally
// to the extended HCI path with LEGACY-bit (0x2036), which produced
// non-connectable PDUs on the nRF54L15 SW-LL.  The true extended path
// (0x203x, AUX_ADV_IND) was connectable but caused two problems:
//   1. iOS CoreBluetooth does not reliably complete GATT after connecting via
//      extended advertising (zero ATT PDUs observed in all test sessions).
//   2. After each connection the controller auto-stops the advertising set, and
//      the subsequent bt_le_ext_adv_delete() sends LE Remove Advertising Set
//      (0x203c) which times out → kernel oops at hci_core.c:506.
//
// With CONFIG_BT_EXT_ADV=n the host uses pure legacy HCI commands - the same
// path Nordic NCS uses in all nRF54L15 examples (peripheral_uart,
// peripheral_lbs) and which is universally iOS-compatible.  The legacy data
// payload is 31 bytes:
//   FLAGS (3B) + UUID128 (18B) = 21B in adv; NAME in scan-response (17B).

static void start_advertising()
{
    // IMPORTANT: BT_DATA_BYTES() uses C99 compound literals that GCC C++ treats
    // as temporaries; with -Os the compiler may elide writes, leaving stack
    // uninitialized.  Use static const arrays for stable data (flags, UUID)
    // and a runtime pointer for the dynamic device name.
    static const uint8_t adv_flags_val[] = {BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR};
    static const uint8_t adv_uuid128_val[] = {MESH_SVC_UUID_VAL};

    const char *name = bt_get_name();
    size_t full_name_len = strlen(name);

    // Legacy scan-response payload is 31 bytes total. Each AD entry costs 2
    // bytes (length + type), leaving 29 bytes for the name. With
    // CONFIG_BT_DEVICE_NAME_MAX=32 the name can exceed that - truncate and
    // mark as SHORTENED so bt_le_adv_start() doesn't reject the payload.
    constexpr size_t LEGACY_SCAN_RSP_NAME_MAX = 31 - 2;
    bool name_shortened = full_name_len > LEGACY_SCAN_RSP_NAME_MAX;
    uint8_t name_len = (uint8_t)(name_shortened ? LEGACY_SCAN_RSP_NAME_MAX : full_name_len);

    // Primary advertising data: FLAGS + Meshtastic service UUID128 (21 bytes
    // total)
    struct bt_data ad[] = {
        {BT_DATA_FLAGS, sizeof(adv_flags_val), adv_flags_val},
        {BT_DATA_UUID128_ALL, sizeof(adv_uuid128_val), adv_uuid128_val},
    };
    // Scan response: device name (discovered after scan request)
    struct bt_data sd[] = {
        {(uint8_t)(name_shortened ? BT_DATA_NAME_SHORTENED : BT_DATA_NAME_COMPLETE), name_len, (const uint8_t *)name},
    };

    // BT_LE_ADV_OPT_CONN         = connectable legacy ADV_IND + stops after first
    //                              connection (replaces deprecated
    //                              CONNECTABLE|ONE_TIME in Zephyr 4.2.1;
    //                              BT_LE_ADV_OPT_CONN = BIT(0)|BIT(1))
    // BT_LE_ADV_OPT_USE_IDENTITY = use static random identity address (stable
    // across reboots) Advertising restart after disconnect is via
    // adv_restart_work (system workqueue) so calling bt_le_adv_start() from the
    // BT RX thread context is avoided.
    int err = bt_le_adv_start(BT_LE_ADV_PARAM(BT_LE_ADV_OPT_CONN | BT_LE_ADV_OPT_USE_IDENTITY, BT_GAP_ADV_FAST_INT_MIN_2,
                                              BT_GAP_ADV_FAST_INT_MAX_2, NULL),
                              ad, ARRAY_SIZE(ad), sd, ARRAY_SIZE(sd));

    if (err == -EALREADY) {
        return;
    }
    if (err) {
        LOG_WARN("BLE adv start failed: %d", err);
    } else {
        LOG_INFO("BLE advertising as '%s'", bt_get_name());
    }
}

static void stop_advertising()
{
    bt_le_adv_stop();
}

// ── Connection callbacks
// ──────────────────────────────────────────────────────

static void connected_cb(struct bt_conn *conn, uint8_t err)
{
    if (err) {
        LOG_WARN("BLE connection failed, err=0x%02x", err);
        return;
    }

