meshtastic/firmware/src/platform/nrf54l15/NRF54L15Bluetooth.cpp
    k_mutex_lock(&ble_mutex, K_FOREVER);
    active_conn = bt_conn_ref(conn);
    k_mutex_unlock(&ble_mutex);

    memset(lastToRadio, 0, sizeof(lastToRadio));
    connect_time_ms = Time::skipZero(k_uptime_get_32());
    last_att_time_ms = connect_time_ms;

    char addr[BT_ADDR_LE_STR_LEN];
    bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));
    LOG_INFO("BLE connected: %s", addr);

    meshtastic::BluetoothStatus newStatus(meshtastic::BluetoothStatus::ConnectionState::CONNECTED);
    bluetoothStatus->updateStatus(&newStatus);

    // nRF54L15-DK has no screen - cannot display a PIN to the user.
    // Requesting BT_SECURITY_L2 causes the OS to show a pairing dialog that
    // the user dismisses, triggering disconnect + advertising restart failure.
    // Skip security negotiation; the Meshtastic app works over plain GATT.
    // (Security can be re-enabled once a display or NFC OOB path is available.)
}

static void disconnected_cb(struct bt_conn *conn, uint8_t reason)
{
    LOG_INFO("BLE disconnected, reason=0x%02x", reason);

    k_mutex_lock(&ble_mutex, K_FOREVER);
    if (active_conn) {
        bt_conn_unref(active_conn);
        active_conn = nullptr;
    }
    k_mutex_unlock(&ble_mutex);

    fromnum_ccc_val = 0;
    logradio_ccc_val = 0;
    connect_time_ms = 0;
    last_att_time_ms = 0;

    if (phoneAPI) {
        phoneAPI->close();
    }
    memset(lastToRadio, 0, sizeof(lastToRadio));

    meshtastic::BluetoothStatus newStatus(meshtastic::BluetoothStatus::ConnectionState::DISCONNECTED);
    bluetoothStatus->updateStatus(&newStatus);

    // Schedule advertising restart via work queue - NOT from this callback
    // directly. disconnected_cb runs on the BT RX thread; calling
    // bt_le_adv_start() here would deadlock (see adv_restart_work comment above).
    if (ble_enabled) {
        k_work_submit(&adv_restart_work);
    }
}

#if defined(CONFIG_BT_SMP)
static void security_changed_cb(struct bt_conn *conn, bt_security_t level, enum bt_security_err err)
{
    if (err == BT_SECURITY_ERR_PIN_OR_KEY_MISSING) {
        // Phone has a stale bond (device was wiped/reflashed).  Unpair the stale
        // entry so the phone re-pairs cleanly on the next connection attempt.
        LOG_WARN("BLE stale bond (key missing) - unpairing");
        bt_unpair(BT_ID_DEFAULT, bt_conn_get_dst(conn));
        bt_conn_disconnect(conn, BT_HCI_ERR_AUTH_FAIL);
    } else if (err) {
        LOG_WARN("BLE security change failed: level=%d err=%d", (int)level, (int)err);
    } else {
        LOG_INFO("BLE security level %d established", (int)level);
    }
}
#endif /* CONFIG_BT_SMP */

BT_CONN_CB_DEFINE(conn_callbacks) = {
    .connected = connected_cb,
    .disconnected = disconnected_cb,
#if defined(CONFIG_BT_SMP)
    .security_changed = security_changed_cb,
#endif
};

// ── Pairing / auth callbacks
// ──────────────────────────────────────────────────

#if defined(CONFIG_BT_SMP)
static uint32_t configuredPasskey;

static void auth_passkey_display(struct bt_conn *conn, unsigned int passkey)
{
    char passkey_str[7];
    snprintf(passkey_str, sizeof(passkey_str), "%06u", passkey);
    configuredPasskey = passkey;
    LOG_INFO("BLE pairing PIN: %s", passkey_str);
    powerFSM.trigger(EVENT_BLUETOOTH_PAIR);

    std::string textkey(passkey_str);
    meshtastic::BluetoothStatus pairingStatus(textkey);
    bluetoothStatus->updateStatus(&pairingStatus);
}

static void auth_cancel(struct bt_conn *conn)
{
    LOG_WARN("BLE pairing cancelled");
}

static struct bt_conn_auth_cb auth_cb = {
    .passkey_display = auth_passkey_display,
    .passkey_entry = NULL,
    .cancel = auth_cancel,
};

static void pairing_complete_cb(struct bt_conn *conn, bool bonded)
{
    LOG_INFO("BLE pairing complete, bonded=%d", (int)bonded);
    meshtastic::BluetoothStatus newStatus(meshtastic::BluetoothStatus::ConnectionState::CONNECTED);
    bluetoothStatus->updateStatus(&newStatus);
}

static void pairing_failed_cb(struct bt_conn *conn, enum bt_security_err reason)
{
    LOG_WARN("BLE pairing failed, reason=%d", (int)reason);
    meshtastic::BluetoothStatus newStatus(meshtastic::BluetoothStatus::ConnectionState::DISCONNECTED);
    bluetoothStatus->updateStatus(&newStatus);
}

static struct bt_conn_auth_info_cb auth_info_cb = {
    .pairing_complete = pairing_complete_cb,
    .pairing_failed = pairing_failed_cb,
};
#endif /* CONFIG_BT_SMP */

// ── BluetoothPhoneAPI methods
// ─────────────────────────────────────────────────

void BluetoothPhoneAPI::onNowHasData(uint32_t fromRadioNum)
{
    PhoneAPI::onNowHasData(fromRadioNum);
    fromNumValue = fromRadioNum;

    if (!(fromnum_ccc_val & BT_GATT_CCC_NOTIFY))
        return;

    // active_conn may be torn down on another thread while we're dispatching
    // this notify - acquire under ble_mutex so disconnected_cb can't free the
    // conn between the null check and bt_conn_ref.
    struct bt_conn *conn = acquire_active_conn();
    if (!conn)
        return;
    bt_gatt_notify(conn, &mesh_svc.attrs[FROMNUM_ATTR_IDX], &fromNumValue, sizeof(fromNumValue));
    bt_conn_unref(conn);
}

bool BluetoothPhoneAPI::checkIsConnected()
{
    return active_conn != nullptr;
}

// ── Deferred ToRadio processor + zombie-connection watchdog ──────────────────
//
// write_toradio() runs on the BT RX workqueue thread (CONFIG_BT_RX_STACK_SIZE)
// and cannot execute phoneAPI->handleToRadio() directly: handleStartConfig
// recurses through nanopb encode + state machine init and overflows the RX
// stack.  This thread runs on the Meshtastic OSThread scheduler (24 KB stack),
// picks up the pending ToRadio buffer flagged by write_toradio(), and calls
// handleToRadio() with plenty of headroom.
//
// Real-time fromNum notifications are sent synchronously from
// BluetoothPhoneAPI::onNowHasData() (called by PhoneAPI when new data is
// queued).
//
// Zombie-connection detection has two tiers:
//
//   (1) Liveness probe.  After IDLE_BEFORE_PROBE_MS without ATT traffic, send
//       a bt_gatt_notify to fromNum every PROBE_INTERVAL_MS.  If the
//       controller replies -ENOTCONN the LL link is definitely dead but the
//       host didn't forward LE Disconnection Complete → reboot.  We avoid
//       probing during normal activity so iOS isn't woken up unnecessarily
//       (each probe wakes iOS → triggers a zero-byte FromRadio drain).
//
//   (2) Hard watchdog.  Absolute HARD_WATCHDOG_MS ceiling on ATT idle as a
//       fallback if probes somehow don't detect the zombie.
class BleDeferredThread : public concurrency::OSThread
{
    static constexpr uint32_t IDLE_BEFORE_PROBE_MS = 30000; //  30 s: start probing
    static constexpr uint32_t PROBE_INTERVAL_MS = 5000;     //   5 s: between probes
    static constexpr uint32_t HARD_WATCHDOG_MS = 60000;     //   1 min: last resort

