meshtastic/firmware/src/platform/nrf54l15/NRF54L15Bluetooth.cpp
    uint32_t last_probe_ms = 0;

  public:
    BleDeferredThread() : concurrency::OSThread("BleDeferred") {}

  protected:
    int32_t runOnce() override
    {
        // Snapshot the pending ToRadio buffer under the mutex, then release
        // the lock before calling into handleToRadio (which can be slow and
        // must not block the BT RX thread producer).
        uint8_t buf[MAX_TO_FROM_RADIO_SIZE];
        size_t n = 0;
        bool have_pending = false;
        k_mutex_lock(&pendingToRadioMutex, K_FOREVER);
        if (pendingToRadio) {
            memcpy(buf, pendingToRadioBuf, pendingToRadioLen);
            n = pendingToRadioLen;
            pendingToRadio = false;
            have_pending = true;
        }
        k_mutex_unlock(&pendingToRadioMutex);
        if (have_pending && phoneAPI) {
            phoneAPI->handleToRadio(buf, n);
        }

        // Take a reference to active_conn so it can't be freed underneath us
        // if disconnected_cb fires on another thread while we're dispatching.
        struct bt_conn *conn = acquire_active_conn();
        if (!conn || connect_time_ms == 0) {
            if (conn)
                bt_conn_unref(conn);
            last_probe_ms = 0;
            return 100;
        }

        uint32_t now = k_uptime_get_32();
        uint32_t att_idle = now - last_att_time_ms;

        // Liveness probe - only when ATT has been quiet for a while.
        if (att_idle > IDLE_BEFORE_PROBE_MS && (now - last_probe_ms) >= PROBE_INTERVAL_MS &&
            (fromnum_ccc_val & BT_GATT_CCC_NOTIFY)) {
            last_probe_ms = now;
            int err = bt_gatt_notify(conn, &mesh_svc.attrs[FROMNUM_ATTR_IDX], &fromNumValue, sizeof(fromNumValue));
            if (err == -ENOTCONN) {
                LOG_WARN("BLE zombie (probe ENOTCONN); rebooting");
                bt_conn_unref(conn);
                k_sleep(K_MSEC(50)); // flush log
                sys_reboot(SYS_REBOOT_COLD);
            }
        }
        bt_conn_unref(conn);

        // Hard ceiling - last-resort reboot if probes miss the zombie.
        if (att_idle > HARD_WATCHDOG_MS && (now - connect_time_ms) > HARD_WATCHDOG_MS) {
            LOG_WARN("BLE zombie (hard watchdog %us); rebooting", HARD_WATCHDOG_MS / 1000);
            k_sleep(K_MSEC(50));
            sys_reboot(SYS_REBOOT_COLD);
        }
        return 100;
    }
};

static BleDeferredThread *bleDeferredThread = nullptr;

// ── BT stack pre-initializer (call from main thread before OSThreads start) ──
//
// bt_enable() requires substantially more stack than a Meshtastic OSThread
// (PowerFSMThread) provides - calling it there causes a stack overflow.
// Call this from nrf54l15Setup() (main Zephyr thread, CONFIG_MAIN_STACK_SIZE)
// so that by the time NRF54L15Bluetooth::setup() runs from PowerFSMThread,
// bt_initialized is already true and bt_enable() is skipped.

void nrf54l15_bt_preinit()
{
    if (!bt_initialized) {
        int err = bt_enable(NULL);
        if (err) {
            LOG_ERROR("BLE pre-init failed: %d", err);
            return;
        }
        bt_initialized = true;
        LOG_INFO("BLE stack pre-initialized on main thread");

        // Phase 7: load bonding keys from LittleFS (/lfs/bt_settings).
        // LittleFS is already mounted by fsInit() before nrf54l15Setup() runs.
        // On first boot the file doesn't exist - settings_load() returns 0 (OK).
        // On subsequent boots, previously bonded peers are restored so the
        // phone can reconnect without re-pairing.
        err = settings_load();
        if (err) {
            LOG_WARN("settings_load failed: %d (OK on first boot)", err);
        } else {
            LOG_INFO("BT settings loaded from /lfs/bt_settings");
        }
    }
}

// ── NRF54L15Bluetooth public methods ─────────────────────────────────────────

// Shared init: idempotent setup of work item, OSThread, auth callbacks,
// bt_enable, and device name. Leaves advertising control to the caller.
static bool nrf54l15_bt_init_common()
{
    k_work_init(&adv_restart_work, adv_restart_work_fn);

    if (!bleDeferredThread) {
        bleDeferredThread = new BleDeferredThread();
    }

    if (!phoneAPI) {
        phoneAPI = new BluetoothPhoneAPI();
    }

#if defined(CONFIG_BT_SMP)
    // NO_PIN is unsupported on this platform: the mesh GATT permissions are
    // declared with BT_GATT_PERM_*_AUTHEN, prj.conf sets
    // CONFIG_BT_SMP_ENFORCE_MITM=y, and the build pulls in the SMP/passkey path.
    // If a user requested NO_PIN we'd register no auth callbacks → no display
    // path for the passkey → every GATT access returns BT_ATT_ERR_AUTHENTICATION
    // and the link is unusable. Fall back to RANDOM_PIN behavior with a warning
    // instead of leaving BLE silently broken.
    if (config.bluetooth.mode == meshtastic_Config_BluetoothConfig_PairingMode_NO_PIN) {
        LOG_WARN("BLE: NO_PIN not supported on nRF54L15-DK (MITM-only build); "
                 "treat as RANDOM_PIN");
    }

    bt_conn_auth_cb_register(&auth_cb);
    bt_conn_auth_info_cb_register(&auth_info_cb);

    // FIXED_PIN - register the configured passkey so the mobile app prompts
    // the user for that specific number instead of a random display-only PIN.
    // RANDOM_PIN (and clamped NO_PIN) keeps the default behavior: Zephyr
    // generates a fresh passkey on each pairing attempt and fires
    // auth_passkey_display with it.
    if (config.bluetooth.mode == meshtastic_Config_BluetoothConfig_PairingMode_FIXED_PIN) {
        configuredPasskey = config.bluetooth.fixed_pin;
        int rc = bt_passkey_set(configuredPasskey);
        if (rc) {
            LOG_WARN("bt_passkey_set(%u) failed: %d", configuredPasskey, rc);
        } else {
            LOG_INFO("BLE fixed PIN: %06u", configuredPasskey);
        }
    } else {
        bt_passkey_set(BT_PASSKEY_INVALID); // random per-pair
    }
#endif /* CONFIG_BT_SMP */

    if (!bt_initialized) {
        int err = bt_enable(NULL);
        if (err) {
            LOG_ERROR("BLE enable failed: %d", err);
            return false;
        }
        bt_initialized = true;
        LOG_INFO("BLE stack enabled");
    }

    bt_set_name(getDeviceName());
    return true;
}

void NRF54L15Bluetooth::setup()
{
    LOG_INFO("NRF54L15Bluetooth::setup()");
    if (!nrf54l15_bt_init_common()) {
        return;
    }
    ble_enabled = true;
    start_advertising();
}

