meshtastic/firmware/src/platform/nrf54l15/NRF54L15Bluetooth.cpp
void NRF54L15Bluetooth::shutdown()
{
    LOG_INFO("NRF54L15Bluetooth::shutdown()");
    ble_enabled = false;
    stop_advertising();

    struct bt_conn *conn = acquire_active_conn();
    if (conn) {
        bt_conn_disconnect(conn, BT_HCI_ERR_REMOTE_USER_TERM_CONN);
        bt_conn_unref(conn);
    }
}

void NRF54L15Bluetooth::startDisabled()
{
    // Initialize BT stack but leave advertising off until resumeAdvertising().
    if (!nrf54l15_bt_init_common()) {
        return;
    }
    ble_enabled = false;
    LOG_INFO("BLE initialized, adv stopped (startDisabled)");
}

void NRF54L15Bluetooth::resumeAdvertising()
{
    ble_enabled = true;
    start_advertising();
}

void NRF54L15Bluetooth::clearBonds()
{
    LOG_INFO("BLE clear bonds");
    bt_unpair(BT_ID_DEFAULT, BT_ADDR_LE_ANY);
}

bool NRF54L15Bluetooth::isConnected()
{
    return active_conn != nullptr;
}

int NRF54L15Bluetooth::getRssi()
{
    return 0; // TODO: Zephyr has no direct bt_conn_get_rssi; use HCI RSSI read
              // command
}

void NRF54L15Bluetooth::sendLog(const uint8_t *logMessage, size_t length)
{
    if (length > 512 || logradio_ccc_val == 0) {
        return;
    }
    // Acquire a reference under ble_mutex so disconnected_cb can't free the
    // connection between the null check and bt_gatt_notify.
    struct bt_conn *conn = acquire_active_conn();
    if (!conn) {
        return;
    }
    // Send as notify regardless of whether client subscribed to NOTIFY or
    // INDICATE - bt_gatt_indicate() requires a params struct with a callback;
    // notify is simpler and the app accepts both. Change to indicate if
    // compatibility issues arise.
    bt_gatt_notify(conn, &mesh_svc.attrs[LOGRADIO_ATTR_IDX], logMessage, (uint16_t)length);
    bt_conn_unref(conn);
}
